stu_title = ['학번','이름','국어','수학','과학','합계','평균']
stu_datas = [
 [1,'홍길동',100,100,100,99],
 [2,'유관순',99,99,100,99],
 [3,'이순신',100,99,98,99],
 [4,'김구',80,100,90,99],
 [5,'김유신',80,100,90,99],
 ]

# for문 사용해서 출력하시오.
# [ 학생성적 프로그램 ]
# 번호    이름    국어    영어    수학    과학    합계    평균
# ------------------------------------------------------------
# 1       유관순  100     100     100     99      399     99.75

for s_t in stu_title:
    print("{}".format(s_t),end='\t') 
print()
print("-"*60)
print("                    [학생성적 프로그램]")
print("-"*62)
for s in stu_datas:
    print("{}\t{}\t{}\t{}\t{}\t{}\t{}\t{:.2f}".format(
    s[0],s[1],s[2],s[3],s[4],s[5],
    s[2]+s[3]+s[4]+s[5],(s[2]+s[3]+s[4]+s[5])/4))


